//index.js
//获取应用实例
const app = getApp();

Page({
	data: {

		//列表
		list:[
			{
				name:'微信支付 30元 3000+啊发生地方',
				info:'xadf123123123123123123123',
				time:'2018-12-12'
			},
			{
				name:'微信支付 30元 3000+啊发生地方',
				info:'xadf123123123123123123123',
				time:'2018-12-12'
			},
			{
				name:'微信支付 30元 3000+啊发生地方',
				info:'xadf123123123123123123123',
				time:'2018-12-12'
			},
			{
				name:'微信支付 30元 3000+啊发生地方',
				info:'xadf123123123123123123123',
				time:'2018-12-12'
			}
		]



	},
	onLoad: function () {





	}
});
