//index.js
//获取应用实例
const app = getApp();

Page({
	data: {
		//热门推荐
		list:[
			{
				name:'按快点交罚款的叫法是看见对方奥斯卡来访登记卡死垃圾的疯狂拉升京东方昂克赛拉的房间卡死垃圾'
			},
			{
				name:'2按快点交罚款的叫法是看见对方奥斯卡来访登记卡死垃圾的疯狂拉升京东方昂克赛拉的房间卡死垃圾'
			},
			{
				name:'1按快点交罚款的叫法是看见对方奥斯卡来访登记卡死垃圾的疯狂拉升京东方昂克赛拉的房间卡死垃圾'
			}
		],

		//正文内容
		info:[]

	},
	onLoad: function () {
		//正文处理 需要确保最终输出的是2个连续的br标签
		let text = '　　K市。<br/><br/>　　一场由霍氏举办的盛大宴会正在帝华国际酒店大厅内举行。<br/><br/>　　无比璀璨的灯光下，来参加酒会的名媛贵妇们更是神采动人。<br/><br/>　　身穿米色单肩晚礼服的黎晓曼手持酒杯与贵妇们应酬，脸上带着标致礼貌的微笑，内心却充满了苦楚。<br/><br/>　　霍家周年庆冒出如此多的名媛贵妇，都是奔着她来的。<br/><br/>　　不知为何最近各种新闻都在谣传她与各种男人出轨，几乎所有人都是奔着来看霍家笑话来的，而她的丈夫霍云烯却偏偏没有来参加宴会，而且还迟迟联系不上。<br/><br/>　　虽然嫁入霍家之后，她与霍云烯并没有圆房，但是她对霍云烯依然有一丝期待。<br/><br/>　　她不能再让谣言诋毁她，更不能再让霍云烯被别人说戴了绿帽子，这影响到的不止是他的名誉，还有霍家的名誉。<br/><br/>　　“霍太太，听说你和当红小生陈晨在夏威夷成双成对，不知道是不是真的？”<br/><br/>　　“霍太太，不知道你有没有看昨天的报纸，有人爆出你和AU集团的刘总从酒店一起出来，还有照片为证，不知道你怎么解释呢。”<br/><br/>　　明明没有做过的事情，却被莫名其妙的被人诬陷，黎晓曼内心很委屈，愤怒，同时也很疑惑，到底是谁在造谣诋毁她。<br/><br/>　　虽然百思不得其解，但是她明白今天这个事情，她必须要解释清楚。好在她已经早有准备了。<br/><br/>　　她轻咬了下唇，便看着站在她身前的两名看她笑话的贵妇说道：“王太太、何太太，其实这样的事情我觉得解释并没有意义。明显是有人恶意攻击，若是解释起来，反而有一种掩饰的意思了。今天我真的很开心，因为今天是我的生日，云烯他没有来，就是因为在忙着布置只属于我们两人的生日paty。”<br/><br/>　　一边说着，黎晓曼一边轻咬着下嘴唇，哪个女人不希望心爱的男人给自己庆祝生日，可是云烯对自己有多么的冷淡，这些事情只能是妄想了吧……<br/><br/>　　掩下心里的苦涩和痛楚，黎晓曼尽量让自己表现的更加自然，继续说：“不过，在和云烯一起庆祝生日之前，我也满足一下大家的好奇心吧。<br/><br/>　　王太太，您说我和陈晨在夏威夷成双成对是吗？那个新闻我看了，这好像是上个星期的事情，说的是我和他一起在沙滩上晒日光浴。<br/><br/>　　这个季节夏威夷的太阳可不是一般的猛烈，可是您看我的皮肤，可是和您的一样白皙呢，怎么可能会是在夏威夷里晒过日光浴呢？要真有这么好的防晒产品的话，那你们专做化妆品的王家不可能不知道吧，不如和大家说一说到底什么产品？”<br/><br/>　　王太太听完她这番话，一时哑口无言，再找不到话反驳。<br/><br/>　　黎晓曼看着她温婉一笑，看向了何太太，“何太太，你说的那条我和刘总一起出入酒店的新闻我也看见了，当然照片也看见了。照片上并没有拍到那个女人的脸对吧？看那个女人的身形确实跟我挺像的，不过不知道何小姐有没有注意到，那个女人的手上戴着天使之星。我记得天使之星前几天被刘总在珠宝展上拍下来，当场当着媒体的面戴在了他太太的手上，所以那个女人不是我，而是刘太太。何太太不止是珠宝爱好者，也是开珠宝设计公司的，应该不会不认识那颗由首席珠宝设计师Duo大师亲自设计的全钻戒指吧。”<br/><br/>　　何太太听她这样一说，也一时愣住了，再找不到话反驳。<br/><br/>　　黎晓曼见她愣住，便笑着继续说道：“最近像这种乱七八糟的假新闻还有很多，不过我们都是女人，今天有人污蔑我，明天也会有人污蔑你们。为了我们自己，让我们一起抵抗这种低俗的新闻媒体。我敬大家一杯，愿意和我一起喝酒的就是我的好姐妹。”<br/><br/>　　话落，她姿态优雅的举起了酒杯。<br/><br/>　　王太太和何太太见状，也朝她举起了酒杯。';
		text = text.split('<br\/><br\/>');
		this.setData({
			info:text
		})

	}
});
