//index.js
//获取应用实例
const app = getApp();

Page({
	data: {

		//列表
		list:[
			{
				name:'书名书名书名书名书名书名书名',
				info:'章节名章节名章节名章节名章节名章节名',
				time:'2018-12-12',
				number:'20'
			},
			{
				name:'书名书名书名书名书名书名书名',
				info:'章节名章节名章节名章节名章节名章节名',
				time:'2018-12-12',
				number:'20'
			},
			{
				name:'书名书名书名书名书名书名书名',
				info:'章节名章节名章节名章节名章节名章节名',
				time:'2018-12-12',
				number:'20'
			},
			{
				name:'书名书名书名书名书名书名书名',
				info:'章节名章节名章节名章节名章节名章节名',
				time:'2018-12-12',
				number:'20'
			}
		]



	},
	onLoad: function () {





	}
});
